mfkiwl/Code-Work-F1C100/单片机原理/多功能MP3_201706060714_蒋晨辉/MP3 Player/Bsp/fatfs_port_tm4c1294.c
/*-----------------------------------------------------------------------*/
/* MMC/SDC (in SPI mode) control module  (C)ChaN, 2007                   */
/*-----------------------------------------------------------------------*/
/* Only rcvr_spi(), xmit_spi(), disk_timerproc() and some macros         */
/* are platform dependent.                                               */
/*-----------------------------------------------------------------------*/

/*
 * This file was modified from a sample available from the FatFs
 * web site. It was modified to work with an EK-TM4C1294XL and EK-TM4C129EXL
 * evaluation boards.
 */

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/ssi.h"
#include "driverlib/sysctl.h"
#include "third_party/fatfs/src/diskio.h"


/* Definitions for MMC/SDC command */
#define CMD0    (0x40+0)    /* GO_IDLE_STATE */
#define CMD1    (0x40+1)    /* SEND_OP_COND */
#define CMD8    (0x40+8)    /* SEND_IF_COND */
#define CMD9    (0x40+9)    /* SEND_CSD */
#define CMD10    (0x40+10)    /* SEND_CID */
#define CMD12    (0x40+12)    /* STOP_TRANSMISSION */
#define CMD16    (0x40+16)    /* SET_BLOCKLEN */
#define CMD17    (0x40+17)    /* READ_SINGLE_BLOCK */
#define CMD18    (0x40+18)    /* READ_MULTIPLE_BLOCK */
#define CMD23    (0x40+23)    /* SET_BLOCK_COUNT */
#define CMD24    (0x40+24)    /* WRITE_BLOCK */
#define CMD25    (0x40+25)    /* WRITE_MULTIPLE_BLOCK */
#define CMD41    (0x40+41)    /* SEND_OP_COND (ACMD) */
#define CMD55    (0x40+55)    /* APP_CMD */
#define CMD58    (0x40+58)    /* READ_OCR */

#define EK_TM4C129_BP1

#if defined(EK_TM4C129_BP1)
/* Peripheral definitions for EK-TM4C1294XL and EK-TM4C129EXL boards */
/* SSI port */
#define SDC_SSI_BASE            SSI2_BASE
#define SDC_SSI_SYSCTL_PERIPH   SYSCTL_PERIPH_SSI2

/* GPIO for SSI pins */
/* CLK pin */
#define SDC_SSI_CLK_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOD
#define SDC_SSI_CLK_GPIO_PORT_BASE   GPIO_PORTD_BASE
#define SDC_SSI_CLK             GPIO_PIN_3
/* TX pin */
#define SDC_SSI_TX_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOD
#define SDC_SSI_TX_GPIO_PORT_BASE   GPIO_PORTD_BASE
#define SDC_SSI_TX              GPIO_PIN_1
/* RX pin */
#define SDC_SSI_RX_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOD
#define SDC_SSI_RX_GPIO_PORT_BASE   GPIO_PORTD_BASE
#define SDC_SSI_RX              GPIO_PIN_0
/* CS pin */
#define SDC_SSI_FSS_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOD
#define SDC_SSI_FSS_GPIO_PORT_BASE   GPIO_PORTD_BASE
#define SDC_SSI_FSS             GPIO_PIN_2
#elif defined(EK_TM4C129_BP2)
/* Peripheral definitions for EK-TM4C1294XL and EK-TM4C129EXL boards */
/* SSI port */
#define SDC_SSI_BASE            SSI2_BASE
#define SDC_SSI_SYSCTL_PERIPH   SYSCTL_PERIPH_SSI2

/* GPIO for SSI pins */
/* CLK pin */
#define SDC_SSI_CLK_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOA
#define SDC_SSI_CLK_GPIO_PORT_BASE   GPIO_PORTA_BASE
#define SDC_SSI_CLK             GPIO_PIN_2
/* TX pin */
#define SDC_SSI_TX_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOA
#define SDC_SSI_TX_GPIO_PORT_BASE   GPIO_PORTA_BASE
#define SDC_SSI_TX              GPIO_PIN_4
/* RX pin */
#define SDC_SSI_RX_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOA
#define SDC_SSI_RX_GPIO_PORT_BASE   GPIO_PORTA_BASE
#define SDC_SSI_RX              GPIO_PIN_5
/* CS pin */
#define SDC_SSI_FSS_SYSCTL_PERIPH    SYSCTL_PERIPH_GPIOP
#define SDC_SSI_FSS_GPIO_PORT_BASE   GPIO_PORTP_BASE
#define SDC_SSI_FSS             GPIO_PIN_5
#else
#error ERROR: Booster Pack Header not defined!
#endif

/* must be supplied by the application */
extern uint32_t SysClock;
#define ui32SysClock SysClock

/* asserts the CS pin to the card */
static
void SELECT (void)
{
    ROM_GPIOPinWrite(SDC_SSI_FSS_GPIO_PORT_BASE, SDC_SSI_FSS, 0);
}

/* de-asserts the CS pin to the card */
static
void DESELECT (void)
{
    ROM_GPIOPinWrite(SDC_SSI_FSS_GPIO_PORT_BASE, SDC_SSI_FSS, SDC_SSI_FSS);
}

/*--------------------------------------------------------------------------

   Module Private Functions

---------------------------------------------------------------------------*/

static volatile
DSTATUS Stat = STA_NOINIT;    /* Disk status */

static volatile
BYTE Timer1, Timer2;    /* 100Hz decrement timer */

static
BYTE CardType;            /* b0:MMC, b1:SDC, b2:Block addressing */

static
BYTE PowerFlag = 0;     /* indicates if "power" is on */

/*-----------------------------------------------------------------------*/
/* Transmit a byte to MMC via SPI  (Platform dependent)                  */
/*-----------------------------------------------------------------------*/

static
void xmit_spi(BYTE dat)
{
    uint32_t ui32RcvDat;

    ROM_SSIDataPut(SDC_SSI_BASE, dat); /* Write the data to the tx fifo */

    ROM_SSIDataGet(SDC_SSI_BASE, &ui32RcvDat); /* flush data read during the write */
}


/*-----------------------------------------------------------------------*/
/* Receive a byte from MMC via SPI  (Platform dependent)                 */
/*-----------------------------------------------------------------------*/

static
BYTE rcvr_spi (void)
{
    uint32_t ui32RcvDat;

    ROM_SSIDataPut(SDC_SSI_BASE, 0xFF); /* write dummy data */

    ROM_SSIDataGet(SDC_SSI_BASE, &ui32RcvDat); /* read data frm rx fifo */

    return (BYTE)ui32RcvDat;
}


static
void rcvr_spi_m (BYTE *dst)
{
    *dst = rcvr_spi();
}

/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/

static
BYTE wait_ready (void)
{
    BYTE res;


    Timer2 = 50;    /* Wait for ready in timeout of 500ms */
    rcvr_spi();
    do
        res = rcvr_spi();
    while ((res != 0xFF) && Timer2);

    return res;
}

/*-----------------------------------------------------------------------*/
/* Send 80 or so clock transitions with CS and DI held high. This is     */
/* required after card power up to get it into SPI mode                  */
/*-----------------------------------------------------------------------*/
static
void send_initial_clock_train(void)
{
    unsigned int i;
    uint32_t ui32Dat;

    /* Ensure CS is held high. */
    DESELECT();

    /* Switch the SSI TX line to a GPIO and drive it high too. */
    ROM_GPIOPinTypeGPIOOutput(SDC_SSI_TX_GPIO_PORT_BASE, SDC_SSI_TX);
    ROM_GPIOPinWrite(SDC_SSI_TX_GPIO_PORT_BASE, SDC_SSI_TX, SDC_SSI_TX);

    /* Send 10 bytes over the SSI. This causes the clock to wiggle the */
    /* required number of times. */
    for(i = 0 ; i < 10 ; i++)
    {
        /* Write DUMMY data. SSIDataPut() waits until there is room in the */
        /* FIFO. */
        ROM_SSIDataPut(SDC_SSI_BASE, 0xFF);

